# Rebar Free Form Creation Result Rebar Property

Source: https://www.revitapidocs.com/2026/1789667a-87cf-9fe9-33c9-fe3ad4b8cc61.htm

---

| Rebar Free Form Creation Result Rebar Property |
| --- |

Identifies the created Rebar. If the error code is Success, then it will be a valid rebar, otherwise it will be a Rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public Rebar Rebar { get; }
```

```
Public ReadOnly Property Rebar As Rebar
	Get
```

```
public:
property Rebar^ Rebar {
	Rebar^ get ();
}
```

```
member Rebar : Rebar with get
```

#### Property Value

Rebar See Also

#### Reference

RebarFreeFormCreationResult Class Autodesk.Revit.DB.Structure Namespace